name: "sam_encoder_onnx"
platform: "onnxruntime_onnx"
max_batch_size : 0
input [
  {
    name: "input_image"
    data_type: TYPE_FP32
    format: FORMAT_NONE
    dims: [ -1,-1,3 ]
    is_shape_tensor: false,
    allow_ragged_batch: false,
    optional: false
  }  
]
output [
  {
    name: "image_embeddings"
    data_type: TYPE_FP32
    dims: [ 1, 256, 64, 64 ]
    label_filename: "",
    is_shape_tensor: false
  }
]
instance_group[
  {
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]